#+latex_class: IEEEtran
#+latex_class_options: [journal, 11pt]
#+bind: org-latex-default-figure-position "H"
#+bind: org-latex-minted-options (("rulecolor" "gray") ("frame" "leftline") ("fontsize" "\\scriptsize") ("xleftmargin" "20pt") ("baselinestretch" "0.9"))
#+latex_header: \usepackage{siunitx}
#+property: header-args:python :eval no-export :exports results
#+property: header-args:bash :results drawer :eval no-export :exports code
#+options: num:t toc:t tags:nil

#+author: Lewis Collum
#+title: Rectangular Patch Antenna Array Design
# #+title: Rectangular Patch Antenna Array Design Supplement
#+bind: org-latex-image-default-width ".8\\linewidth"
# #+latex_class_options: [onecolumn]
#+exclude_tags: noexport supplement

** Directivity
   <<sec-directivity-single>>
   Directivity of the main lobe (in figure [[fig-patchTotalRadiation]])
   is the maximum radiation intensity over the average intensity,
   cite:ulaby
   #+begin_latex
   \begin{equation} \label{eq-dir}
     D = \dfrac{F_{max}}{F_{average}} = \dfrac{1}{\dfrac{1}{4\pi} \Omega_p}
   \end{equation}
   #+end_latex

   where \(\Omega_p\) is the pattern solid angle. Note that for a
   /normalized/ radiation intensity, the maximum, \(F_{max}\), will be
   equal to 1, by definition.
   
   The pattern solid angle is defined as cite:ulaby
   #+begin_latex
   \begin{equation} \label{eq-solidAngle} 
     \Omega_p = \iint_{4\pi} F(\phi, \theta) \,d\theta \,d\phi.
   \end{equation}
   #+end_latex
   
   Since we have the electric field intensity stored as a 2-dimensional
   array, we use simpson's rule to calculate the double integral.

   This yields a directivity of,
   #+begin_src python :results output latex
import numpy
from source import patch as pt
from scipy.integrate import simps

rtDuroid5880 = pt.Material(
    relativePermittivity = 2.2,
    height = 0.1588E-2)
patchBuilder = pt.PatchBuilder(rtDuroid5880)

patch = patchBuilder.buildForFrequency(10E9)
radiation = pt.PatchRadiation(patch, resolution = 100)
directivity = radiation.directivity()

print((f'\[D = {directivity:.2f}\]'))
   #+end_src

   #+RESULTS:
   #+begin_export latex
   \[D = 3.17\]
   #+end_export
      
** Directivity
   Using eq. ref:eq-array-rad for total array radiation and plugging
   the result into the solid angle equation (eq. ref:eq-solidAngle),
   we find the directivity (eq. ref:eq-dir) for each patch array.

   This yields patch array directivities of,
   #+begin_src python :results output latex :async
import numpy
from source import patch as pt
from source import plotter as pl
from source import conversion as conv
from source import array as pa

rtDuroid5880 = pt.Material(
    relativePermittivity = 2.2,
    height = 0.1588E-2)
patchBuilder = pt.PatchBuilder(rtDuroid5880)
        
frequency = 10E9
wavelength = conv.frequencyToWavelength(frequency)
patch = patchBuilder.buildForFrequency(frequency)
radiation = pt.PatchRadiation(patch, resolution = 100)

x = numpy.arange(2,5)
for i in x:
    elements = pa.spacedPositions((1,i,i), wavelength/2)
    array = pa.ArrayRadiation(radiation.totalAsSpherical(), wavelength, elements)
    endPunctuation = '.' if i == x[-1] else ','
    print(f'\[D_{{{i}x{i}}} = {array.directivity():.2f}{endPunctuation}\]')
   #+end_src

   #+RESULTS:
   #+begin_export latex
   \[D_{2x2} = 7.30,\]
   \[D_{3x3} = 12.53,\]
   \[D_{4x4} = 19.61.\]
   #+end_export

   In theory, the more patches we add to the array, the higher the
   directivity (and gain) becomes. As a note, gain is \[G = \epsilon
   D,\] where \epsilon is the antenna efficiency. We assume an
   efficiency of 100% for this analysis, so we obtain no additional
   by calculating gain.
